//
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3)
{
    alert('Large massive with 3 and more elements')
}
else {
    alert('Tiny massive')
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
// let nmbr=[11, 8, 10]
// if ((nmbr[0]<=nmbr[1] && nmbr[1]<=nmbr[2]) || (nmbr[2]>=nmbr[1] && nmbr[1]>=nmbr[0])){
//     console.log('second number larger than first and less than third')
// } else if ((nmbr[1]>=nmbr[0] && nmbr[0]>=nmbr[2]) || (nmbr[2]>=nmbr[0] && nmbr[0]>=nmbr[1])){
//     console.log('first number less than second and less than third')
// } else if ((nmbr[0]<=nmbr[2] && nmbr[2]>=nmbr[1]) || (nmbr[1]<=nmbr[2] && nmbr[2]>=nmbr[0])){
//     console.log('third number larger than second and first')
// }
// else {
//     console.log('He-he-he')
//}

let nmbr=[8, 1, 10]
if ((nmbr[0]<=nmbr[1] && nmbr[1]<=nmbr[2]) || (nmbr[2]<=nmbr[1] && nmbr[1]<=nmbr[0])){
    console.log('2 number larger than 1 and less than 3')
} else if ((nmbr[1]<=nmbr[0] && nmbr[0]<=nmbr[2]) || (nmbr[2]<=nmbr[0] && nmbr[0]<=nmbr[1])){
    console.log('1 number is middle')
} else if ((nmbr[0]<=nmbr[2] && nmbr[2]<=nmbr[1]) || (nmbr[1]<=nmbr[2] && nmbr[2]<=nmbr[0])){
    console.log('3 number is midlle')
}
else {
    console.log('He-he-he')
}

// let x= 4>5
// console.log(x)






// - Перепишіть конструкцію if з використанням умовного оператора '?':
let a= 4;
let b=2;
a + b < 4 ?
console.log('Мало') : console.log('Багато');




// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
//
//
//
//
//
//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//
//
//
//
//
//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//
//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .